package by.academy.classwork.lesson4;

public class Task29 {

	public static void main(String[] args) {
		// 29. с помощью оператора while напишите программу вывода всех четных чисел в
		// диапазоне от 2 до 100 включительно.

		int x = 0;
		while (x < 100) {
			x += 2;
			System.out.print(x + " ");
		}
	}
}
