package by.academy.classwork.lesson4.arrays;
import java.util.Arrays;

public class Task1class {

	public static void main(String[] args) {
//		// 		0. Создать массив типа String с размером 7. 
//		Записать в него значения дней недели. 
//		Вывести на консоль значение последнего элемента.

		String [] array = {"Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота","Воскресенье"};
		System.out.println(array [6]);
	}

}
