package by.academy.classwork.lesson4.arrays;
import java.util.Arrays;
public class Task2class {

	public static void main(String[] args) {
//		// 1. Создать массив типа double с размером 4.
//		 Записать в него любые значения с помощью блока для инициализации. 
//		 Вывести на консоль значение первого элемента. 

		double [] array = {5.0, 4.5, 2.3, 4.9};
		System.out.println(array [0]);
	}

}
